cpp_generated_methods.org
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+KEYWORDS: c++ compiler constructor destructor
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: C++: methods are generated by compiler

* Methods are generated by compiler
  A compiler generates four methods:
    1. Default constructor
    2. Copy constructor
    3. Operator =
    4. Destructor
  If you want to implement your own version of either *copy constructor* or *operator=* or *destructor*
  then you must implement all other methods that are listed above.
  #+NAME: all_methods
  #+BEGIN_SRC cpp :exports code :noweb yes :results output :flags -std=c++11
    #include <cstddef>
    #include <iostream>

    class IntArray {
    public:
        // Constructor
        explicit IntArray(size_t size) : size_(size), data_(new int[size]) {
            std::cout << "Constructor for " << this << std::endl;

            for (size_t i = 0; i != size_; ++i)
                this->data_[i] = 0;
        }

        // Copy constructor
        IntArray(IntArray const& a) : size_(a.size_), data_(new int[size_]) {
            std::cout << "Copy Constructor for " << this << std::endl;

            for (size_t i = 0; i != this->size_; ++i)
                this->data_[i] = a.data_[i];
        }

        // Assign operator
        IntArray & operator=(IntArray const& a) {
            std::cout << "Operator =" << std::endl;

            if (this != &a)
                // Will create a temporary copy of a object and send it to swap
                IntArray(a).swap(*this);
            std::cout << "Return reference to this = " << this << std::endl;
            return *this;
        }

        // Destructor
        ~IntArray() {
            std::cout << "Destructor for " << this << std::endl;

            delete [] this->data_;
        }

        void swap(IntArray & a) {
            std::swap(this->size_, a.size_);
            std::swap(this->data_, a.data_);
        }

    private:
        size_t size_;
        int *data_;
    };

    int main() {
        IntArray a1(10);
        IntArray a2(20);
        IntArray a3 = a1;
        a2 = a1;

        return 0;
    }

  #+END_SRC

  #+RESULTS: all_methods
  #+begin_example
  Constructor for 0x7ffc70ebdfd0
  Constructor for 0x7ffc70ebdfe0
  Copy Constructor for 0x7ffc70ebdff0
  Operator =
  Copy Constructor for 0x7ffc70ebdfa0
  Destructor for 0x7ffc70ebdfa0
  Return reference to this = 0x7ffc70ebdfe0
  Destructor for 0x7ffc70ebdff0
  Destructor for 0x7ffc70ebdfe0
  Destructor for 0x7ffc70ebdfd0
  #+end_example

** Constructor
   /Constructors/ are methods for structures initialization. If structure/class has no /constructors/, then
   default /constructor/ (without arguments) will be automatically generated by compiler.
   #+NAME: constructors
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     struct Point {
         Point () {                  // Default constructor
             x = y = 0;
         }

         Point (double x = 0, double y = 0) : x(x), y(y) {}

     private:
         double x;
         double y;
     };

     int main() {
         Point p1;                   // {0, 0}
         Point p2(2);                // {2, 0}
         Point p3(3, 7);
     }
   #+END_SRC
   Here is the /constructor/ with initializers list that allows initialize fields before /constructor/ was called:
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     Point (double x, double y) : y(0), x(y) {}
   #+END_SRC
   the key point here is that initialization order is the same as fields definition order
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     private:
         double x;
         double y;
   #+END_SRC
   x will go first and then y.

