cpp_generated_methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-05 Mon 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++: methods are generated by compiler</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="c++ compiler constructor destructor" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">C++: methods are generated by compiler</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2fd4808">1. Methods are generated by compiler</a>
<ul>
<li><a href="#org851713e">1.1. Constructor</a>
<ul>
<li><a href="#org5a09795">1.1.1. Explicit constructor</a></li>
<li><a href="#org8ee063f">1.1.2. Constructors and function definitons</a></li>
</ul>
</li>
<li><a href="#org87c2275">1.2. Destructor</a></li>
<li><a href="#orga006bb6">1.3. Copy constructor</a></li>
<li><a href="#org090c47a">1.4. Assign operator</a>
<ul>
<li><a href="#orgda746a8">1.4.1. Disallow copying</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2fd4808" class="outline-2">
<h2 id="org2fd4808"><span class="section-number-2">1</span> Methods are generated by compiler</h2>
<div class="outline-text-2" id="text-1">
<p>
A compiler generates four methods:
</p>
<ol class="org-ol">
<li>Default constructor</li>
<li>Copy constructor</li>
<li>Operator =</li>
<li>Destructor</li>
</ol>
<p>
If you want to implement your own version of either <b>copy constructor</b> or <b>operator=</b> or <b>destructor</b>
then you must implement all other methods that are listed above.
</p>
<div class="org-src-container">
<pre class="src src-cpp" id="org2d242c5"><span style="color: #8090A2;">#include</span> <span style="color: #ffa500;">&lt;cstddef&gt;</span>
<span style="color: #8090A2;">#include</span> <span style="color: #ffa500;">&lt;iostream&gt;</span>

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">IntArray</span> {
<span style="color: #00ff00; font-weight: bold;">public</span>:
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Constructor</span>
    <span style="color: #00ff00; font-weight: bold;">explicit</span> <span style="color: #00ffff; font-weight: bold;">IntArray</span>(<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size</span>) : size_(size), data_(<span style="color: #00ff00; font-weight: bold;">new</span> <span style="color: #00ffff;">int</span>[size]) {
        <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa500;">"Constructor for "</span> &lt;&lt; <span style="color: #00ff00; font-weight: bold;">this</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

        <span style="color: #00ff00; font-weight: bold;">for</span> (<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">i</span> = 0; i != size_; ++i)
            <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_[i] = 0;
    }

    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Copy constructor</span>
    <span style="color: #00ffff; font-weight: bold;">IntArray</span>(<span style="color: #00ffff;">IntArray</span> <span style="color: #00ff00; font-weight: bold;">const</span>&amp; <span style="color: #ffffff;">a</span>) : size_(a.size_), data_(<span style="color: #00ff00; font-weight: bold;">new</span> <span style="color: #00ffff;">int</span>[size_]) {
        <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa500;">"Copy Constructor for "</span> &lt;&lt; <span style="color: #00ff00; font-weight: bold;">this</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

        <span style="color: #00ff00; font-weight: bold;">for</span> (<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">i</span> = 0; i != <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;size_; ++i)
            <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_[i] = a.data_[i];
    }

    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Assign operator</span>
    <span style="color: #00ffff;">IntArray</span> &amp; <span style="color: #00ff00; font-weight: bold;">operator</span><span style="color: #00ffff; font-weight: bold;">=</span>(<span style="color: #00ffff;">IntArray</span> <span style="color: #00ff00; font-weight: bold;">const</span>&amp; <span style="color: #ffffff;">a</span>) {
        <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa500;">"Operator ="</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

        <span style="color: #00ff00; font-weight: bold;">if</span> (<span style="color: #00ff00; font-weight: bold;">this</span> != &amp;a)
            <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Will create a temporary copy of a object and send it to swap</span>
            IntArray(a).swap(*<span style="color: #00ff00; font-weight: bold;">this</span>);
        <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa500;">"Return reference to this = "</span> &lt;&lt; <span style="color: #00ff00; font-weight: bold;">this</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
        <span style="color: #00ff00; font-weight: bold;">return</span> *<span style="color: #00ff00; font-weight: bold;">this</span>;
    }

    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Destructor</span>
    ~<span style="color: #00ffff; font-weight: bold;">IntArray</span>() {
        <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa500;">"Destructor for "</span> &lt;&lt; <span style="color: #00ff00; font-weight: bold;">this</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

        <span style="color: #00ff00; font-weight: bold;">delete</span> [] <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_;
    }

    <span style="color: #00ffff;">void</span> <span style="color: #00ffff; font-weight: bold;">swap</span>(<span style="color: #00ffff;">IntArray</span> &amp; <span style="color: #ffffff;">a</span>) {
        <span style="color: #7fffd4;">std</span>::swap(<span style="color: #00ff00; font-weight: bold;">this</span>-&gt;size_, a.size_);
        <span style="color: #7fffd4;">std</span>::swap(<span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_, a.data_);
    }

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size_</span>;
    <span style="color: #00ffff;">int</span> *<span style="color: #ffffff;">data_</span>;
};

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
    <span style="color: #00ffff;">IntArray</span> <span style="color: #ffffff;">a1</span>(10);
    <span style="color: #00ffff;">IntArray</span> <span style="color: #ffffff;">a2</span>(20);
    <span style="color: #00ffff;">IntArray</span> <span style="color: #ffffff;">a3</span> = a1;
    a2 = a1;

    <span style="color: #00ff00; font-weight: bold;">return</span> 0;
}

</pre>
</div>
</div>

<div id="outline-container-org851713e" class="outline-3">
<h3 id="org851713e"><span class="section-number-3">1.1</span> Constructor</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<i>Constructors</i> are methods for structures initialization. If structure/class has no <i>constructors</i>, then
default <i>constructor</i> (without arguments) will be automatically generated by compiler.
</p>
<div class="org-src-container">
<pre class="src src-cpp" id="org3a880a6"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">Point</span> {
    <span style="color: #00ffff; font-weight: bold;">Point</span> () {                  <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Default constructor</span>
        x = y = 0;
    }

    <span style="color: #00ffff; font-weight: bold;">Point</span> (<span style="color: #00ffff;">double</span> <span style="color: #ffffff;">x</span> = 0, <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">y</span> = 0) : x(x), <span style="color: #00ffff;">y</span>(<span style="color: #ffffff;">y</span>) {}

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">x</span>;
    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">y</span>;
};

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p1</span>;                   <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">{0, 0}</span>
    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p2</span>(2);                <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">{2, 0}</span>
    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p3</span>(3, 7);
}
</pre>
</div>
<p>
Here is the <i>constructor</i> with initializers list that allows initialize fields before <i>constructor</i> was called:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ffff; font-weight: bold;">Point</span> (<span style="color: #00ffff;">double</span> <span style="color: #ffffff;">x</span>, <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">y</span>) : y(0), x(y) {}
</pre>
</div>
<p>
the key point here is that initialization order is the same as fields definition order
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">x</span>;
    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">y</span>;
</pre>
</div>
<p>
x will go first and then y.
</p>
</div>
