cpp_generated_methods.org
*** Explicit constructor
    A /constructor/ taking a single argument defines a conversion from its argument type.
    #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
      struct Segment {
          Segment() = default;
          Segment (double length) : p2(length, 0) {}

          Point p1;
          Point p2;
      };

      int main() {
          Segment s1;                 // (0, 0), (0, 0)
          Segment s2(10);             // (0, 0), (10, 0)
          Segment s3 = 20;            // (0, 0), (20, 0) = Segment(20)
      }
    #+END_SRC
    The way to avoid this conversion is to say that only explicit "conversion" is allowed
    #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
      struct Segment {
          explicit Segment (double length) : p2(length, 0) {}
          …
      };

      int main() {
          Point p = 20;               // error
      }
    #+END_SRC

*** Constructors and function definitons
    *If something in C++ looks like a function definition, it is a function definition!*
    #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
      class Point {
      public:
          explicit Point(double x=0, double y=0) : x(x), y(y) {}
      private:
          double x;
          double y;
      };

      int main() {
          Point p1;                   // variable definition
          Point p2();                 // function definition:
                                      //   p2 takes no arguments, returns Point value

          double k = 5.1;
          Point p3(int(k));           // function definition
          Point p4((int)k);           // variable definition
      }
    #+END_SRC

** Destructor
   /Destructor/ is a method that will be called when we /delete/ a structure.
   The name of a /destructor/ is the complement operator *~*, followed by the name of the class;
   it is the complement of a /constructor/.
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     struct IntArray {
         explicit IntArray(size_t size) : size(size), data(new int[size]) {}

         ~IntArray() {
             delete [] data;
         }

     private:
         size_t size;
         int * data;
     };
   #+END_SRC
   So far, we can call the time between /constructor/ calling and /destructor/ calling is a variable's *lifetime*.
   Every time you call /constructor/, it locates the object into the stack. /Destructors/ will be called in reversed order then.

** Copy constructor
   Here is the problem with a default copying of objects.
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     #include <cstddef>

     class IntArray {
     public:
         explicit IntArray(size_t size)
             : size_(size), data_(new int[size]) {
             for (size_t i = 0; i != size_; ++i) {
                 this->data_[i] = 0;
             }
         }

         ~IntArray() {
             delete [] this->data_;
         }

     private:
         size_t size_;
         int *data_;
     };

     int main() {
         IntArray a1(10);
         IntArray a2(20);
         IntArray a3 = a1;
         // memory leak!
         // a2->data_ isn't available anymore and won't be deleted with a destructor!
         a2 = a1;
         // will try to free the same memory area twice with
         // delete [] this->data_
         // that will cause an error
         return 0;
     }

   #+END_SRC
   If you didn't implement a /copy constructor/, it will be generated automatically by compiler.
   Here we implement our own version of /copy constructor/:
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     struct IntArray {
         IntArray (IntArray const & a) : size_(a.size_), data_(new int[size_]) {
             for (size_t i = 0; i != size_; ++i) {
                 data_[i] = a.data_[i];
             }
         }

     private:
         size_t size_;
         int * data_;
     };
   #+END_SRC

