cpp_generated_methods.html

<div id="outline-container-org5a09795" class="outline-4">
<h4 id="org5a09795"><span class="section-number-4">1.1.1</span> Explicit constructor</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
A <i>constructor</i> taking a single argument defines a conversion from its argument type.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">Segment</span> {
    <span style="color: #00ffff; font-weight: bold;">Segment</span>() = <span style="color: #00ff00; font-weight: bold;">default</span>;
    <span style="color: #00ffff; font-weight: bold;">Segment</span> (<span style="color: #00ffff;">double</span> <span style="color: #ffffff;">length</span>) : p2(length, 0) {}

    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p1</span>;
    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p2</span>;
};

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
    <span style="color: #00ffff;">Segment</span> <span style="color: #ffffff;">s1</span>;                 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">(0, 0), (0, 0)</span>
    <span style="color: #00ffff;">Segment</span> <span style="color: #ffffff;">s2</span>(10);             <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">(0, 0), (10, 0)</span>
    <span style="color: #00ffff;">Segment</span> <span style="color: #ffffff;">s3</span> = 20;            <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">(0, 0), (20, 0) = Segment(20)</span>
}
</pre>
</div>
<p>
The way to avoid this conversion is to say that only explicit "conversion" is allowed
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">Segment</span> {
    <span style="color: #00ff00; font-weight: bold;">explicit</span> <span style="color: #00ffff; font-weight: bold;">Segment</span> (<span style="color: #00ffff;">double</span> <span style="color: #ffffff;">length</span>) : p2(length, 0) {}
    &#8230;
};

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p</span> = 20;               <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">error</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ee063f" class="outline-4">
<h4 id="org8ee063f"><span class="section-number-4">1.1.2</span> Constructors and function definitons</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<b>If something in C++ looks like a function definition, it is a function definition!</b>
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Point</span> {
<span style="color: #00ff00; font-weight: bold;">public</span>:
    <span style="color: #00ff00; font-weight: bold;">explicit</span> <span style="color: #00ffff; font-weight: bold;">Point</span>(<span style="color: #00ffff;">double</span> <span style="color: #ffffff;">x</span>=0, <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">y</span>=0) : x(x), <span style="color: #00ffff;">y</span>(<span style="color: #ffffff;">y</span>) {}
<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">x</span>;
    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">y</span>;
};

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
    <span style="color: #00ffff;">Point</span> <span style="color: #ffffff;">p1</span>;                   <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">variable definition</span>
    <span style="color: #00ffff;">Point</span> <span style="color: #00ffff; font-weight: bold;">p2</span>();                 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">function definition:</span>
                                <span style="color: #5F7F5F;">//   </span><span style="color: #ffa500; font-style: italic;">p2 takes no arguments, returns Point value</span>

    <span style="color: #00ffff;">double</span> <span style="color: #ffffff;">k</span> = 5.1;
    <span style="color: #00ffff;">Point</span> <span style="color: #00ffff; font-weight: bold;">p3</span>(<span style="color: #00ffff;">int</span>(<span style="color: #ffffff;">k</span>));           <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">function definition</span>
    Point <span style="color: #ffffff;">p4</span>((<span style="color: #00ffff;">int</span>)k);           <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">variable definition</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org87c2275" class="outline-3">
<h3 id="org87c2275"><span class="section-number-3">1.2</span> Destructor</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<i>Destructor</i> is a method that will be called when we <i>delete</i> a structure.
The name of a <i>destructor</i> is the complement operator <b>~</b>, followed by the name of the class;
it is the complement of a <i>constructor</i>.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">IntArray</span> {
    <span style="color: #00ff00; font-weight: bold;">explicit</span> <span style="color: #00ffff; font-weight: bold;">IntArray</span>(<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size</span>) : size(size), data(<span style="color: #00ff00; font-weight: bold;">new</span> <span style="color: #00ffff;">int</span>[size]) {}

    ~<span style="color: #00ffff; font-weight: bold;">IntArray</span>() {
        <span style="color: #00ff00; font-weight: bold;">delete</span> [] data;
    }

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size</span>;
    <span style="color: #00ffff;">int</span> * <span style="color: #ffffff;">data</span>;
};
</pre>
</div>
<p>
So far, we can call the time between <i>constructor</i> calling and <i>destructor</i> calling is a variable's <b>lifetime</b>.
Every time you call <i>constructor</i>, it locates the object into the stack. <i>Destructors</i> will be called in reversed order then.
</p>
</div>
</div>

<div id="outline-container-orga006bb6" class="outline-3">
<h3 id="orga006bb6"><span class="section-number-3">1.3</span> Copy constructor</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Here is the problem with a default copying of objects.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8090A2;">#include</span> <span style="color: #ffa500;">&lt;cstddef&gt;</span>

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">IntArray</span> {
<span style="color: #00ff00; font-weight: bold;">public</span>:
    <span style="color: #00ff00; font-weight: bold;">explicit</span> <span style="color: #00ffff; font-weight: bold;">IntArray</span>(<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size</span>)
        : size_(size), data_(<span style="color: #00ff00; font-weight: bold;">new</span> <span style="color: #00ffff;">int</span>[size]) {
        <span style="color: #00ff00; font-weight: bold;">for</span> (<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">i</span> = 0; i != size_; ++i) {
            <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_[i] = 0;
        }
    }

    ~<span style="color: #00ffff; font-weight: bold;">IntArray</span>() {
        <span style="color: #00ff00; font-weight: bold;">delete</span> [] <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_;
    }

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size_</span>;
    <span style="color: #00ffff;">int</span> *<span style="color: #ffffff;">data_</span>;
};

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
    <span style="color: #00ffff;">IntArray</span> <span style="color: #ffffff;">a1</span>(10);
    <span style="color: #00ffff;">IntArray</span> <span style="color: #ffffff;">a2</span>(20);
    <span style="color: #00ffff;">IntArray</span> <span style="color: #ffffff;">a3</span> = a1;
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">memory leak!</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">a2-&gt;data_ isn't available anymore and won't be deleted with a destructor!</span>
    a2 = a1;
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">will try to free the same memory area twice with</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">delete [] this-&gt;data_</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">that will cause an error</span>
    <span style="color: #00ff00; font-weight: bold;">return</span> 0;
}

</pre>
</div>
<p>
If you didn't implement a <i>copy constructor</i>, it will be generated automatically by compiler.
Here we implement our own version of <i>copy constructor</i>:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">IntArray</span> {
    <span style="color: #00ffff; font-weight: bold;">IntArray</span> (<span style="color: #00ffff;">IntArray</span> <span style="color: #00ff00; font-weight: bold;">const</span> &amp; <span style="color: #ffffff;">a</span>) : size_(a.size_), data_(<span style="color: #00ff00; font-weight: bold;">new</span> <span style="color: #00ffff;">int</span>[size_]) {
        <span style="color: #00ff00; font-weight: bold;">for</span> (<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">i</span> = 0; i != size_; ++i) {
            data_[i] = a.data_[i];
        }
    }

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size_</span>;
    <span style="color: #00ffff;">int</span> * <span style="color: #ffffff;">data_</span>;
};
</pre>
</div>
</div>
</div>
