cpp_generated_methods.org
** Assign operator
   If you didn't implement a /assign operator/, it will be generated by a compiler as well.
   Here we implement an *operator=* method.
   #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
     struct IntArray {
         IntArray & operator=(IntArray const & a) {
             if (this != &a) {
                 delete [] data_;
                 this->size_ = a.size_;
                 this->data_ = new int[size_];
                 for (size_t i = 0; i != size_; ++i) {
                     data_[i] = a.data_[i];
                 }
             }
             return *this;
         }

     private:
         size_t size_;
         int * data_;
     };
   #+END_SRC

*** Disallow copying
    If you want to disallow copying of object
    (it isn't clear how to copy database connection object, for example)
    you can declare a /copy constructor/ and an /assign operator/ as /private methods/ and do not implement them.
    #+BEGIN_SRC cpp :exports code :noweb yes :results none :flags -std=c++11
      class IntArray {
          IntArray (IntArray const & a);
          IntArray & operator= (IntArray const & a);

          size_t size_;
          int * data_;

      public:
          …
      };
    #+END_SRC
