cpp_generated_methods.html

<div id="outline-container-org090c47a" class="outline-3">
<h3 id="org090c47a"><span class="section-number-3">1.4</span> Assign operator</h3>
<div class="outline-text-3" id="text-1-4">
<p>
If you didn't implement a <i>assign operator</i>, it will be generated by a compiler as well.
Here we implement an <b>operator=</b> method.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">IntArray</span> {
    <span style="color: #00ffff;">IntArray</span> &amp; <span style="color: #00ff00; font-weight: bold;">operator</span><span style="color: #00ffff; font-weight: bold;">=</span>(<span style="color: #00ffff;">IntArray</span> <span style="color: #00ff00; font-weight: bold;">const</span> &amp; <span style="color: #ffffff;">a</span>) {
        <span style="color: #00ff00; font-weight: bold;">if</span> (<span style="color: #00ff00; font-weight: bold;">this</span> != &amp;a) {
            <span style="color: #00ff00; font-weight: bold;">delete</span> [] data_;
            <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;size_ = a.size_;
            <span style="color: #00ff00; font-weight: bold;">this</span>-&gt;data_ = <span style="color: #00ff00; font-weight: bold;">new</span> <span style="color: #00ffff;">int</span>[size_];
            <span style="color: #00ff00; font-weight: bold;">for</span> (<span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">i</span> = 0; i != size_; ++i) {
                data_[i] = a.data_[i];
            }
        }
        <span style="color: #00ff00; font-weight: bold;">return</span> *<span style="color: #00ff00; font-weight: bold;">this</span>;
    }

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size_</span>;
    <span style="color: #00ffff;">int</span> * <span style="color: #ffffff;">data_</span>;
};
</pre>
</div>
</div>

<div id="outline-container-orgda746a8" class="outline-4">
<h4 id="orgda746a8"><span class="section-number-4">1.4.1</span> Disallow copying</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
If you want to disallow copying of object
(it isn't clear how to copy database connection object, for example)
you can declare a <i>copy constructor</i> and an <i>assign operator</i> as <i>private methods</i> and do not implement them.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">IntArray</span> {
    <span style="color: #00ffff; font-weight: bold;">IntArray</span> (<span style="color: #00ffff;">IntArray</span> <span style="color: #00ff00; font-weight: bold;">const</span> &amp; <span style="color: #ffffff;">a</span>);
    <span style="color: #00ffff;">IntArray</span> &amp; <span style="color: #00ff00; font-weight: bold;">operator</span><span style="color: #00ffff; font-weight: bold;">=</span> (<span style="color: #00ffff;">IntArray</span> <span style="color: #00ff00; font-weight: bold;">const</span> &amp; <span style="color: #ffffff;">a</span>);

    <span style="color: #00ffff;">size_t</span> <span style="color: #ffffff;">size_</span>;
    <span style="color: #00ffff;">int</span> * <span style="color: #ffffff;">data_</span>;

<span style="color: #00ff00; font-weight: bold;">public</span>:
    &#8230;
};
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2018-03-05 Mon 12:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
